---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceCutout
source: html/9ecb90b9-37c4-583e-4c51-95b36a1f32b7.htm
---
# Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceCutout Property

The property labeled "Image" from the "AdvancedMetal" schema.

## Syntax (C#)
```csharp
public static string SurfaceCutout { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.